{
  "pages": ["home", "about", "projectspage", "students", "nonprofits"],
  "blueprintPositions": [
    "developer",
    "product-designer",
    "project-manager",
    "tech-lead",
    "operational"
  ],
  "common": {
    "blueprint": "SFU Blueprint 2024",
    "terms": "Terms",
    "privacy": "Privacy",
    "cookies": "Cookies"
  },
  "about": {
    "name": "About Us",
    "anchors": ["Who-we-are", "Our-values", "Our-team", "Blog"]
  },
  "home": {
    "header": {
      "title": "Tech for Social Good",
      "text": "We are a team of students committed to developing software pro bono for nonprofits and promoting public welfare.",
      "button": "Work with us"
    },
    "aboutUs": {
      "title": "About Us",
      "text": "We are a team of students based at Simon Fraser University. Our members serve as product managers, developers, designers and other specialists to collaboratively build tech-based solutions for nonprofit organizations. We value community, innovation, and the social impact of our work.",
      "button": "Meet the Team"
    },
    "getinvolved": {
      "students": {
        "title": "STUDENTS",
        "content": "Contribute to building technology for social good. Make new friends and harness your professional skillsets along the away!",
        "button": "Join us →"
      },
      "nonprofits": {
        "title": "NON-PROFITS",
        "content": "Collaborate with us to advance your mission for public welfare. Tackle your challenges with fresh and innovative solutions!",
        "button": "Collaborate with us →"
      },
      "sponsors": {
        "title": "SPONSORS",
        "content": "Support our operation to become part of the changemakers! Elevate your brand while driving meaningful social impact.",
        "button": "Sponsor Us →"
      }
    }
  },
  "projects": {
    "Mosaic": {
      "name": "Mosaic",
      "description": "Aiding New Comers to Canada",
      "tags": ["Immigration", "AI / Bot"],
      "image": "Mosaic.png",
      "popupimage": "mosaic-popup.png",
      "nonProfitDescription": "Mosaic is one of Canada’s largest settlement and employment services organisations. Founded in 1976, Mosaic has since served 26,000 newcomers, has 1200 employer partnerships and a client satisfaction rate of 93%. Their mission is to enrich communities through services and advocacy, furthering the success and sense of belonging of newcomers and individuals from diverse backgrounds.",
      "projectDescription": "Developing an AI chatbot that will help users find relevant programs and services. By offering personalised recommendations, facilitating registration, and communicating in multiple languages, the integration aims to improve the overall experience for MOSAIC's diverse audience, helping them successfully settle in Canada and access the services they need.",
      "page": "https://mosaicbc.org/"
    },
    "Pedals": {
      "name": "Pedals",
      "description": "Empowering Communities Through Bicycles",
      "tags": ["Community", "Admin"],
      "image": "Pedals.png",
      "popupimage": "pedals-popup.png",
      "nonProfitDescription": "Our Community Bikes, which aimed to serve as a DIY repair shop and bike part recycling service to cyclists in Vancouver, was transferred to PEDALS 6 years after it opened. The organization has been offering bike repair workshops to help empower bike users to use their bikes more comfortably. They have also been offering bike mechanic courses and providing employment opportunities to people facing employment barriers. PEDALS regularly engages with around 3 dozen members of the community as volunteers on a weekly basis. They are working towards increasing access to bicycles to underserved communities, and improving sustainability by reducing bike related waste and promoting zero emissions travels.",
      "projectDescription": "To address PEDAL’s desire to have a more streamlined way to sign off on hours at the start and end of the shifts, we created a responsive website which can be used on the iPad in store, and also on a desktop computer, for volunteers to track and manage their shifts and for managers to keep records of their volunteers and create shifts. Some additional key features include a built in a reminder system so that PEDALS can improve volunteer retention, a toggle for all volunteers that indicates their skill level with repairing bikes, and explicit notifications if there was no engagement from a volunteer for a longer period of time.",
      "page": "https://ourcommunitybikes.org/"
    },
    "Blueprint-Website": {
      "name": "Blueprint Website",
      "description": "Volunteer Hour Tracking Platform",
      "tags": ["Innovation", "Website"],
      "image": "Blueprint.png",
      "popupimage": "blueprint-popup.svg",
      "nonProfitDescription": "The primary purpose of our website is to provide a platform to display the types of services and opportunities that we offer for both NPOs and students.  We aim to address the main questions that students have about Blueprint, whilst also conveying key messages about our culture, values and the essence of why we do what we do at SFU Blueprint.",
      "projectDescription": "To address the issue of accessibility and information dissemination, the SFU Blueprint team opted to develop a website utilizing React, Tailwind CSS, and Vercel. This strategic choice was made to ensure a responsive website that effectively communicates information about our projects to a diverse audience, including experienced individuals, students, and older users within the nonprofit community."
    }
  },
  "projectspage": {
    "name": "Projects",
    "anchors": ["Past", "Ongoing"],
    "title": "Our Projects",
    "ongoing": "Ongoing",
    "allprojects": "See all projects →"
  },
  "students": {
    "name": "For Students",
    "anchors": ["Begin","Our-Semester", "Apply"],
    "openPositions": ["product-manager", "product-designer"],
    "phases": ["Begin", "Contribute", "Socialize", "Scheduling"],
    "phasesDesc": [
      "Applying for a Position",
      "Working on a Project",
      "Mingling with Blueprinters",
      "Exams and Semesters End"
    ],
    "stayInTouch": "Are you a student interested in Blueprint, \nand would like to stay up to date with announcements, position openings, \nor just interact with our community?",
    "whyJoinUs": {
      "header": "Blueprint is the right place for you if you are:",
      "list": [
        "<b>a post secondary-student</b> based in the greater Vancouver area",
        "interested in helping nonprofit organizations with your <b>passion for social good</b> and expertise in <b>technology, design, and project management</b>"
      ],
      "text": "Besides real-world experience, we also provide you with support on personal growth and opportunities to meet like-minded new friends!"
    }
  },

  "content": {
    "Applying for a Position": {
      "title": "Applying for a Position",
      "text": "Application forms for new  members are posted at the start of each semester. Resume review and interview usually take 1-2 weeks. One can apply for multiple roles and choose a preferred role if they are qualified for more than one role. \n\nProject members from the previous semester do not need to apply if they are staying at the same team."
    },
    "Working on a Project": {
      "title": "Working on a Project",
      "text": "Project members meet weekly to collaborate and discuss as a team. Product manager and tech lead make key decisions that move the team forward, while project manager keeps team members on the same page and ensure action items for design and development are completed in time."
    },
    "Mingling with Blueprinters": {
      "title": "Mingling with Blueprinters",
      "text": "There will be one to two club-wise activities each semester for members to meet, have fun, and make new friends. We also encourage project teams to get together outside of project. "
    },
    "Exams and Semesters End": {
      "title": "Exams and Semesters End",
      "text": "Workload  will be adjusted during exam periods for members to prioritize their academic studying.\n\nAt the end of the semester, project members will inform the leads whether they will continue on the project for the next semester.\n\nIf a project is completed, we will set up celebration and showcase within our community. Members from the project can apply for roles in new projects afterwards."
    }
  },
  "anchors": {
    "Past": "/projectspage#Ongoing",
    "Ongoing": "/projectspage#Ongoing",
    "Why-choose-us": "/nonprofits#Why-choose-us",
    "Our-criteria": "/nonprofits#Our-criteria",
    "Our-process": "/nonprofits#Our-process",
    "Proposal": "/nonprofits#Proposal",
    "Who-we-are": "/about#Who-we-are",
    "Our-values": "/about#Our-values",
    "Our-team": "/about#Our-team",
    "Begin": "/students#Begin",
    "Apply": "/students#Apply",
    "Our-Semester": "/students#Our-Semester",
    "Blog": "https://medium.com/@sfublueprint"
  },
  "product-manager": {
    "title": "Project Manager (3)",
    "tags": ["Immigration", "AI/Product"],
    "description": "The Project Manager will be responsible for overseeing the successful completion of projects with our NPO partner.",
    "deadline": "Jan 10th, 2024"
  },
  "product-designer": {
    "title": "Product Designer (3)",
    "tags": ["Health", "Machine Learning"],
    "description": "Product Designers are responsible for delivering high-quality UI/UX work for the non-profit projects we build.",
    "deadline": "Jan 10th, 2024"
  },
  "project-developer": {
    "title": "Developer (5)",
    "tags": ["Health", "Machine Learning"],
    "description": "Developers are responsible for delivering high-quality UI/UX work for the non-profit projects we build.",
    "deadline": "Jan 10th, 2024"
  },
  "tech-lead": {
    "title": "Tech Lead (2)",
    "tags": ["Health", "Machine Learning"],
    "description": "Tech Leads are responsible for delivering high-quality UI/UX work for the non-profit projects we build.",
    "deadline": "Jan 10th, 2024"
  },
  "nonprofits": {
    "name": "For Nonprofits",
    "anchors": ["Why-choose-us", "Our-criteria", "Our-process", "Proposal"],
    "applyingLink": "https://forms.gle/MMC1Ww4Uzb7fapw86",
    "whyCollaborateWithUs": "Our members are highly dedicated and have great expertise in technology and design. By working with us, your organization will gain fresh perspectives of your business, increase community engagement with local students, and bring your vision for social good to live through innovative ways, free of charge.",
    "canYourIdeaBecomeAProject": "We consider the following aspects when evaluating potential projects:",
    "forNonProfits": "We can help you achieve your vision with technology - for free",
    "CTA2": "Have a question? Feel free to shoot us an email at",
    "CTA1": "Interested in working with us?\n Submit your initial project proposal below!\n We will get back to you shortly.",
    "aspects": [
      "organizationalNeed",
      "communityImpact",
      "technicalFeasibility",
      "projectScope"
    ],
    "phases": [
      "initialConsulting",
      "productResearchAndScoping",
      "buildingTheMinimumViableProduct",
      "userTesting",
      "productPolishAndHandsOff"
    ],

    "organizationalNeed": {
      "name": "Organizational Need",
      "description": "How does this product improve current business processes (% efficiency, $ saved etc.)? How does it align with long-term organizational vision? How urgently does this product need to be built to address existing concerns?"
    },
    "communityImpact": {
      "name": "Community Impact",
      "description": "How does this product impact the people that the non-profit serves? Does the non-profit understand the challenges encountered by the community in need and how this solution aligns with solving these problems?"
    },
    "technicalFeasibility": {
      "name": "Technical Feasibility",
      "description": "Are the desired features commonly built-in software products or near the frontiers of what can be built? Some examples of solutions we can achieve include: Mobile apps, Websites, In-browser games, Information databases, & AI/machine learning solutions."
    },
    "projectScope": {
      "name": "Project Scope",
      "description": "Can the product be realistically completed in a 4/8/12 month timeline? Are there any external factors such as user interviews and third-party services that could prolong the project?"
    },
    "initialConsulting": {
      "name": "Initial Consulting",
      "description": "After initial outreach, our executive team will meet with the NPO to learn about their request. After the first meeting, our VP scoping will consult members with expertise to understand how Blueprint can take on the project and get back to the NPO with description of possible projects. Once we have agreed on the high-level direction of the project, Blueprint will assemble the project team and start the project in the next semester."
    },
    "productResearchAndScoping": {
      "name": "Product Research And Scoping",
      "description": "To kickstart the collaboration process, our teams will work closely with the nonprofit to gain a greater understanding of project needs and priorities as well as scope out the minimum viable product (MVP). From this point, the product manager will curate a statement of work (SOW) that defines project scope capturing the discussion with the nonprofit."
    },
    "buildingTheMinimumViableProduct": {
      "name": "Building The Minimum Viable Product",
      "description": "This third phase is where the magic begins! Our teams work hard to get the MVP up and running. Throughout this phase, we will stay in touch with the nonprofit to ensure smooth development and consistent alignment."
    },
    "userTesting": {
      "name": "User Testing",
      "description": "Once the MVP is built and released to an initial group of end users, we conduct rigorous testing to ensure no critical problems remain. Additionally, we will take note of any bugs, UX issues, and feature requests during this time."
    },
    "productPolishAndHandsOff": {
      "name": "Product Polish And Hands Off",
      "description": "This phase involves intensive development and design work. Our team will execute improvements on the product based on feedback received from the user testing phase. The objective of this final phase is to ensure the quality and completeness of the finished product. Upon product completion, our team will meet with the nonprofit to walk through maintenance best practices before hand off."
    },
    "sendYourIdeasToUsNow": "Interested in working with us? Submit your initial project proposal below! We will get back to you shortly.",
    "callToContact": "Have a question? Feel free to shoot us an email at "
  },
  "connect": {
    "name": "Connect",
    "links": ["email", "linkedin", "instagram", "github", "discord"]
  },
  "email": {
    "name": "Email",
    "link": "mailto:sfublueprint@gmail.com"
  },
  "instagram": {
    "name": "Instagram",
    "link": "https://www.instagram.com/sfublueprint/"
  },
  "linkedin": {
    "name": "LinkedIn",
    "link": "https://www.linkedin.com/company/sfu-blueprint/"
  },
  "medium": {
    "name": "Medium",
    "link": "https://medium.com/@sfublueprint"
  },
  "github": {
    "name": "Github",
    "link": "https://github.com/SFU-Blueprint"
  },
  "discord": {
    "name": "Discord",
    "link": "https://discord.gg/tmhbeanZhU"
  },
  "roles": [
    "developer",
    "product-designer",
    "project-manager",
    "tech-lead",
    "operational-specialist"
  ],

  "rolesContent": {
    "developer": {
      "title": "Project Developer",
      "desc": [
        "Project Developers are responsible for the <b>development of the project</b>, bringing designs and product specifications to life.",
        "Depending on the scope of the project, each team can have <b>5-8 developers</b>.",
        "They work closely with the project lead, the product manager, and designers to deliver <b>top quality code!</b>"
      ],
      "hiring": false
    },
    "product-designer": {
      "title": "Product Designer",
      "desc": [
        "Product Designers are responsible for delivering <b>high-quality UI/UX work</b> for the non-profit projects we build",
        "There are <b>2-3 designers</b> in each team.",
        "They work closely with <b>various stakeholders</b> including the product manager, the developers on their team, and other designers."
      ],
      "hiring": true
    },
    "project-manager": {
      "title": "Project Manager",
      "desc": [
        "The Project Manager of the team will be responsible for <b>overseeing the successful completion of projects</b> with our NPO partner.",
        "This includes <b>coordinating</b> project activities, <b>managing</b> timelines and resources, and <b>ensuring that project goals align</b> with the needs of the NPO."
      ],
      "hiring": true
    },
    "tech-lead": {
      "title": "Tech Lead",
      "desc": [
        "The Tech Lead for the team is responsible for leading the team and <b>driving the technical direction</b> of the project.",
        "They <b>provide support and mentorship</b> to developers on the team and work with the product manager to run the team effectively"
      ],
      "hiring": false
    },
    "operational-specialist": {
      "title": "Operational/Specialist",
      "desc": [
        "Operational roles such as <b>executives</b> and <b>content specialist</b> are responsible for sustaining Blueprint as a community.",
        "They work to <b>recruit</b> new members, <b>plan activities</b> for members, <b>expand outreach to sponsors and NPOs</b>, and provide extra support to projects teams."
      ],
      "hiring": false
    }
  }
}
